{"name":"Adil Chopra","email":"adilchopra07@gmail.com","profiles":"linkedin.com/in/adilchopra","experience":"Deloitte USI Industry experience: Foodchain/Consumer Retail\nConsultant/Product Owner 12/2021-Present\nModernized the Back-office system for a restaurant group with 600+ stores across the US by introducing new features like Inventory, and recipe management, purchasing, and reporting visibility and dynamic dashboards for sales forecasting\nCounseled the client to understand business needs and translate into functional requirements, whilst accounting for 50% of the laid out functional modules as an SME\nTranslated 8 features into 300+ user stories within the team's backlog while managing, ranking, and prioritizing this backlog to reflect stakeholders' requirements.\nFunctioned closely with client business, leadership, and technical architects to ensure an efficient requirements management process.\nDelivered interactive dashboards on AzureDevops for the client and leadership using various data points to gain better insights on product planning and estimation\nUse case analysis and modeling of detailed functional and non-functional requirements with an analytical approach.\nKey achievement: Introduced and streamlined the Business Analysis process in the team as per Agile practices resulting in 30% improvement in Product Quality Assurance\nAccenture Industry experience: Healthcare/Consumer Retail\nConsultant/Product Owner 07/2018-11/2021\nStrategized the overhaul of an E-Commerce platform for a healthcare client on SAP Commerce Cloud(Hybris) that would cater to the B2C consumer base in the US.\nOrchestrated the Offshore BA team, liaising with the client business, Onshore business, leadership and development teams and leading the Offshore Business Analysts team.\nSpearheaded 150+ workshops to deploy functional modules spanning various Onshore & Offshore teams.\nIndulged in external recruitment activities with a focus on continuous improvement for a company-wide BA community, overlooking a 50% growth in strength and mentoring budding Agile Business Analysts.\nFormulated daily/weekly work plans for the Business Analysts' team while tracking tasks and team collaboration using Agile tool(s), Jira, and Confluence whilst sharing insights with leadership due course.\nKey achievement: Analyzed risks and identified risk mitigation strategies while co-authoring a BAPM(Business Analysis Planning and Monitoring) process for conceiving sanitized user stories that resulted in a 28% and 40% improvement in Product Quality Assurance\nTOOLS\nJira\nConfluence\nAzure DevOps\nSAP Commerce Cloud(Hybris)\nSAP CX(Customer Experience) Suite\nMS Visio\nTableau\nWirestone\nFigma\nAdvanced MS Excel) Suite\nMS Visio\nTableau\nWirestone\nFigma\nAdvanced MS Excel","skills":"AND EXPERTISE\nBusiness Requirements analysis\nRequirements gathering\nStrategic planning\nStakeholder management\nUser Acceptance Testing (UAT)\nGap Analysis\nDocumentation\nBusiness Intelligence (BI)\nWireframing\nChange request management\nTest scripts - Gherkins\nBusiness Process Modeling\nSWOT analysis\nAgile methodologies\nSoftware Development Lifecycle (SDLC)\nAgile Project Management\nData Visualization","certification":"S","education":"Lal Bahadur Shastri Institute of Management, New Delhi 07/2016-03/2018 Master of Business Administration: Marketing and Finance\nChitkara University, Himachal Pradesh 08/2012-04/2016 Bachelor of Engineering: Computer Science\nACHIEVEMENTS\nSpot award (October '22) Deloitte\nApplause award (June '22) Deloitte\nSpot award (May '22) Deloitte\nBusiness requirement Analysis: P4 Expert (June '21) Accenture\nHealthcare/Life Sciences: P3 Advanced (Jan '21) Accenture\nConsumer Retail: P4 Expert (Dec '20) Accenture\nLalita Shastri Memorial Debate Competition: (Dec '17) LBSIM\no Achieved 1st position in the National level B-school Competition"}